#### RenderingImageExposureSettings Members

---

|  |
| --- |
| RenderingImageExposureSettings Class   Methods   Properties   See Also |

The  RenderingImageExposureSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RenderingImageExposureSettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ExposureValue | The value of rendering image exposure. |
| Public property | Highlights | The highlights value. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Saturation | The value of rendering image saturation. |
| Public property | Shadows | The shadows value. |
| Public property | WhitePoint | The white point value. |

# See Also

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace